/* добавление данных в таблицу исполнителей (executor)
 * не менее 8 исполнителей
*/

insert into executor (nickname_executor)
values
('Трибунал'),
('Коrsика'),
('Pavel Plamenev'),
('Radio Tapok'),
('Сколот'),
('Вольный Путь'),
('Nemesea'),
('LASCALA'),
('Bon Jovi');

/* добавление данных в таблицу жанр (genre)
не менее 5 жанров
*/
insert into genre (name_genre)
values
('heavy metal'),
('alternative metal'),
('rock'),
('hard rock'),
('cover'),
('folk rock'),
('gothic metal'),
('symphonic metal'),
('metal'),
('alternative rock');

/* добавление данных в таблицу жанры исполнителей (executers_genres)
*/
insert into executers_genres (id_executor, id_genre)
values
(1, 1),
(1, 2),
(2, 1),
(2, 2),
(2, 3),
(3, 3),
(3, 4),
(4, 1),
(4, 3),
(4, 5),
(5, 6),
(6, 3),
(6, 6),
(7, 7),
(7, 8),
(7, 9),
(8, 3),
(8, 10),
(9, 3),
(9, 4);


/* добавление данных в таблицу альбом (album)
 * не менее 8 альбомов
 */
insert into album (name_album, year_release)
values
('Пустыня идей', 2014),
('Кто я теперь?', 2020),
('Red', 2022),
('Взрывая тишину', 2015),
('Сибирь', 2022),
('Night Before Battle', 2016),
('Наследие', 2022),
('Эхо Времён', 2021),
('Сквозь туман и вьюгу', 2016),
('Вечность', 2020),
('White Flag', 2019),
('Fiesta', 2017),
('Crush', 2000),
('Patagonia', 2018),
('Время', 2018),
('Часовщик', 2018),
('Twilight', 2018);

/* добавление данных в таблицу альбомы исполнителей (albums_executors)
*/
insert into albums_executors (id_executor, id_album)
values 
(1, 1),
(1, 2),
(2, 3),
(2, 4),
(3, 5),
(3, 6),
(4, 7),
(5, 8),
(5, 9),
(6, 10),
(7, 11),
(8, 12),
(9, 13),
(8, 14),
(1, 15),
(6, 16),
(7, 17);

/* добавление данных в таблицу треки (track)
 * не менее 15 треков
 */
insert into track (name_track, duration_track, id_album)
values
('Я подарю жизнь нашей мечте', '7:01', 1),
('Рок – это жизнь!', '00:05:21', 1),
('Кто я теперь?', '00:03:47', 2),
('Новый шанс', '00:03:36', 2),
('На газ', '00:03:15', 3),
('Там, где нас нет', '00:04:15', 3),
('Взрывая тишину', '00:03:43', 4),
('Ночь и драйв', '00:03:11', 4),
('Сибирь', '00:03:25', 5),
('Ночь перед боем', '00:04:00', 6),
('Цусима', '00:04:48', 7),
('Халхин-Гол', '00:04:34', 7),
('Шаман', '00:06:07', 8),
('Варяги', '00:04:54', 9),
('Вечный бой', '00:04:44', 10),
('Dance in the Fire', '00:03:08', 11),
('Реванш', '00:04:28', 12),
('It’s My Life', '00:03:43', 13),
('Селфи', '00:02:57', 14),
('Одинокая искра', '00:05:12', 15),
('Часовщик', '00:03:28', 16),
('Twilight', '00:03:31', 17),
('Мой сон', '00:05:03', 14);

/* добавление данных в таблицу сборники (collection)
 * не менее 8 сборников
 */
insert into collection (name_collection, year_release)
values 
('The Attack of the Dead Men', 2020),
('Songs from 2020 to 2021', 2022),
('Эра героев', 2018),
('Александрия', 2018),
('Рок фестиваль', 2021),
('Всё возможно', 2018),
('Марко Поло', 2014);

/* добавление данных в таблицу сборники треков (collections_tracks)
*/
insert into collections_tracks (id_collection, id_track)
values 
(1, 11),
(1, 12),
(2, 10),
(3, 9),
(4, 7),
(5, 8),
(6, 5),
(6, 15);
